ERP.belugaerp/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮридическоеФизическоеЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮридическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/CommonModules/бг_ОрганизацииИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства, СтандартнаяОбработка) Экспорт
	
	Если бг_ОбщегоНазначенияСервер.ОтменитьЗагрузкуОбъекта(ЗагружаемыйОбъект, СтруктураОбъекта, Неопределено, Неопределено, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗагружаемыйОбъект.ЭтоНовый() Тогда
		ЗагружаемыйОбъект.Заполнить(Неопределено);
	КонецЕсли;
	
	ЗагружаемыйОбъект.НаименованиеСокращенное = СтруктураОбъекта.Наименование;
	
	Если СтруктураОбъекта.ЮрФизЛицо.ЗначениеПеречисления = "ЮрЛицо" Тогда
		ЗагружаемыйОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
		ЗагружаемыйОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ИначеЕсли СтруктураОбъекта.ЮрФизЛицо.ЗначениеПеречисления = "ФизЛицо" Тогда
		ЗагружаемыйОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
		ЗагружаемыйОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	Иначе
		ЗагружаемыйОбъект.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ПустаяСсылка();
		ЗагружаемыйОбъект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ПустаяСсылка();
	КонецЕсли;
	
	СтруктураОбъекта.ЮрФизЛицо = ЗагружаемыйОбъект.ЮрФизЛицо;
	
	ЗагружаемыйОбъект.бг_КодНСИ = СтруктураОбъекта.КодНСИ;
	
КонецПроцедуры

Процедура ЗаполнитьМассивПроверяемыхРеквизитовБлокировки(МетаданныеОбъекта, МассивПроверяемыхРеквизитов, СтандартнаяОбработка) Экспорт
	
	МассивПроверяемыхРеквизитов.Добавить("Предопределенный");
	МассивПроверяемыхРеквизитов.Добавить("ПометкаУдаления");
	МассивПроверяемыхРеквизитов.Добавить("Наименование");
	МассивПроверяемыхРеквизитов.Добавить("НаименованиеСокращенное");
	МассивПроверяемыхРеквизитов.Добавить("ИНН");
	МассивПроверяемыхРеквизитов.Добавить("КПП");
	МассивПроверяемыхРеквизитов.Добавить("ЮрФизЛицо");
	МассивПроверяемыхРеквизитов.Добавить("ЮридическоеФизическоеЛицо");
	
КонецПроцедуры

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт
	
	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.ОставитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());
		
	ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, адаптер_НастройкиОбмена);
		
КонецПроцедуры


Процедура ЗаполнитьТекстыЗапросовУсловиями(ТекстЗапроса, ТекстЗапросаТаблицаКлючей, ПараметрыЗапроса, 
			НастройкаВыгрузки, Объект, СтандартнаяОбработка) Экспорт
	
    ТекстПоиска = "NULL КАК НаименованиеВидаКонтактнойИнформации";
	ТекстЗамены = "КонтактнаяИнформация.Вид.Наименование КАК НаименованиеВидаКонтактнойИнформации";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);

	ТекстПоиска = "NULL КАК НомерСтроки";
	ТекстЗамены = "КонтактнаяИнформация.НомерСтроки КАК НомерСтроки";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекстПоиска, ТекстЗамены);		
			
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыгружаемыеРеквизиты()

	ВыгружаемыеРеквизиты = Новый Массив;
	
	// Шапка
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("Префикс");
	ВыгружаемыеРеквизиты.Добавить("бг_КодНСИ");

	ВыгружаемыеРеквизиты.Добавить("ИНН");
	ВыгружаемыеРеквизиты.Добавить("КПП");
	ВыгружаемыеРеквизиты.Добавить("НаименованиеСокращенное");
	ВыгружаемыеРеквизиты.Добавить("НаименованиеПолное");
	ВыгружаемыеРеквизиты.Добавить("бг_Тикер");
	
	// КонтактнаяИнформация 
	ВыгружаемыеРеквизиты.Добавить("КонтактнаяИнформация.Тип");
	ВыгружаемыеРеквизиты.Добавить("КонтактнаяИнформация.Представление");
	ВыгружаемыеРеквизиты.Добавить("КонтактнаяИнформация.Значение");
	ВыгружаемыеРеквизиты.Добавить("КонтактнаяИнформация.Вид");
	
	ВыгружаемыеРеквизиты = СтрСоединить(ВыгружаемыеРеквизиты, ",");
	
	Возврат ВыгружаемыеРеквизиты;

КонецФункции 

Процедура ДобавитьСвязанныеРеквизитыКВыгрузке(РеквизитыИСвойства, адаптер_НастройкиОбмена)
	
	// КонтактнаяИнформация
	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"КонтактнаяИнформация.НомерСтроки",
		ОбщегоНазначения.ОписаниеТипаЧисло(15));

	адаптер_НастройкиОбмена.ДобавитьРеквизит(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		,
		"КонтактнаяИнформация.НаименованиеВидаКонтактнойИнформации",
		ОбщегоНазначения.ОписаниеТипаСтрока(150));
		
КонецПроцедуры




#КонецОбласти
